# 민사, 행정 CoT 데이터 생성 
JUDGEMENT_PROMPT = """
#instruction#
당신은 법률 전문가입니다.
다음은 하나의 정제된 판례 데이터입니다: 
{input_str}
다음은 관련된 법 조항들입니다: 
{relate_laword}

이제 삼단논법(법률 삼단논법)을 사용하여 판결을 도출해 주세요. 삼단논법에서 대전제는 법규범, 소전제는 사건 사실이며, 각 결론은 반드시 법규범과 사건 사실로부터 도출되어야 합니다.
관련된 법 조항들이 대전제가 되며, "courtDcss"를 바탕으로 법원이 판결을 내리는 데 적용된 주요 법규나 조항을 바탕으로 작성해야 합니다. 
소전제의 경우, 기록에 나타난 증거를 통해 재구성된 사실관계를 바탕으로 작성해야 하며, 법률이나 결과를 명시적으로 언급하지 않고 오직 사실적 맥락을 바탕으로 작성해야 합니다. 
결론은 전제들 간의 논리적 연결을 바탕으로 바탕으로 법적 결론 (판결)을 작성해야 하며, "cnclsns"를 바탕으로 한 두 문장으로 작성해야 합니다.

결과는 반드시 한국어로 작성해야 합니다. 

<예시>
대전제 (법 규범): 타인을 교사하여 특수강도(흉기를 휴대하여 야간에 주거에 침입해 재물을 강취)의 죄를 범하게 한 자는 특수강도죄와 동일한 형으로 처벌한다 (형법 제334조, 제31조 제1항).
소전제 (사건 사실): 피고인 김갑동이 이을남에게 '야구방망이를 챙겨가서' 김부호의 재물을 강취하라고 지시하여, 이을남이 그 지시에 따라 야구방망이를 휴대하고 강도 범행을 실행하였다. 
결론: 위 소전제에 의해서, 김갑동은 특수강도교사죄로 처벌된다.
</예시>

#####
{format_instructions}
"""

# 형법 데이터 생성 
JUDGEMENT_PROMPT_1 = """
#instruction#
당신은 법률 전문가입니다.
다음은 하나의 정제된 판례 데이터입니다: 
{input_str}
다음은 관련된 법 조항들입니다: 
{relate_laword}

이제 삼단논법(법률 삼단논법)을 사용하여 판결과 형벌을 도출해 주세요. 삼단논법에서 대전제는 법규범, 소전제는 사건 사실이며, 각 결론은 반드시 법규범과 사건 사실로부터 도출되어야 합니다.
관련된 법 조항들이 대전제가 되며, "caseNm" 및 "acusrAssrs"를 바탕으로 주요 법규나 조항을 작성해야 하며, 결론과 관련된 조항은 작성하지 않는다.
소전제의 경우, 기록에 나타난 증거를 통해 재구성된 사실관계를 바탕으로 작성해야 하며, 법률이나 결과를 명시적으로 언급하지 않고 오직 사실적 맥락을 바탕으로 작성해야 합니다. 
결론은 전제들 간의 논리적 연결을 바탕으로 바탕으로 법적 결론 (판결) 및 형별을 작성해야 하며, "cnclsns"를 바탕으로 한 두 문장으로 작성해야 합니다. 
항소가 기각된 경우, 항소 기각 여부를 언급해서는 안 되며, "rqestObjet"를 바탕으로 구체적인 형량을 작성해야 합니다.

결과는 반드시 한국어로 작성해야 합니다. 

<예시>
대전제 (법 규범): 행사할 목적으로 권리·의무에 관한 사문서를 변조한 자와, 그 변조된 사문서를 행사한 자는 처벌된다 (형법 제231조, 제234조).
소전제 (사건 사실): 피고인 이을남이 임대차계약서 스캔 파일을 포토샵으로 수정하여 모니터 화면에 보이게 하고, 이 파일을 이메일로 전송하였다. 
결론: 이을남은 사문서변조 및 동행사죄로 3년 이하의 징역에 처한다. 


#####
{format_instructions}
"""

# 법률 질의응답 cot 데이터 생성 # 
QA_PROMPT = """
#instruction#
다음은 법률에 대한 질문과 답변으로 구성된 데이터셋입니다:
{input_str}
{answer}

당신은 법률 전문가로서, 해당 답변을 아래의 순서를 따라 재가공해 작성해야 하며 아래 4개 항목을 정확히 포함해야 합니다. 
외부 지식이나 추가 사례를 임의로 추가해서는 안 됩니다. 

1. 판례 또는 법조문 인용
    - 제시된 판례 또는 법조문을 정확히 인용해야 하며, 변형해서는 안 됩니다. 
2. 사실관계 (상황) 제시
3. 법리 적용 
   - 사실관계와 법적 근거에 기반한 논리적 분석을 제시해야 합니다. 
   - 여러 개를 작성 시, ① ② ③으로 단계 번호를 붙여야 합니다. 
4. 결론 
   - 상담 결론을 작성해야 합니다. 

결과는 반드시 한국어로 작성해야 합니다. 

#####
{format_instructions}
"""

# <사례> 데이터 생성
MCQA_PROMPT = """
#instruction#
당신은 시험 및 기업 교육을 위한 객관식 문제 제작 전문가 교수입니다.
당신의 임무는 응시자의 지식을 종합적으로 평가할 수 있는 도전적이고 잘 구성된 객관식 문제를 개발하는 것입니다. 
다음은 하나의 정제된 판례 데이터입니다: 
{input_str}

입력된 판례 데이터를 바탕으로 아래의 단계에 맞게 **4지선다형** 객관식 문제를 생성해야 합니다. 

Step 1: 문제 유형: [옳은 것을 (가장 적절한 것)을 고르는 문제 / 옳지 않은 것 (가장 적절하지 않은 것)을 고르는 문제] 중 선택해야 한다.
Step 2: <사례> 또는 <상황> 생성: 판례의 핵심 쟁점을 [쟁점 수에 따라 1~2개]의 구체적인 상황으로 분리하여 구성해야 한다.
Step 3: <규정> 또는 <원칙> 생성: {relate_laword}를 바탕으로 판례가 근거한 법조항을 그대로 사용하여 구성해야 하며, 법령을 변형해 작성하는 것은 허용되지 않습니다.
        - <규정>의 법조항은 step 1에서 설정한 핵심 쟁점과 직접적으로 연관한 조항만 포함해야 한다.
        - 문제의 핵심 쟁점 또는 법리를 이해하는 데 불필요하거나 오해를 일으킬 수 있는 조항은 포함해서는 안 된다. 
Step 4: 선지 구성: 정답에 해당하는 선지는 [지정된 판례의 jdgmnInfo 결론]을 도출하도록 유도해야 하며, 선지 간 중복된 내용으로 구성해서는 안 된다. 
        - "옳은 것을 고르는" 문제라면, 참 (True)인 1개, 거짓 (False)인 선지 3개여야 하고, "옳지 않은 것을 고르는" 문제라면, 거짓 (False)인 선지가 1개, 참 (True)인 선지 3개여야 합니다. 
        - 문제에서 주어진 법조헝 외의 다른 법조항을 언급해서 선지를 생성해서는 안 된다. 
오답 선지는 <오답 선지 구성>을 바탕으로 핵심 논리, 절차적 요건, 제도적 취지 중 최소 2가지 이상을 혼합하여 논리적 오류를 포함하도록 구성해야 한다.
    <오답 선지 구성>
	- 법적 요건/예외 혼동 유도: 판례가 인정한 예외적 상황을 원칙적 결론으로 이끌거나, 필수적인 요건을 누락한 채 결론을 도출 또는 법률상 요건은 맞지만 결론을 반대로 설정 
	- 적용 범위/주체/절차 오류 유도: 판례가 인정한 청구권의 주체를 잘못 지정하거나, 판례의 법리를 적용할 수 없는 상황으로 확대 해석
	- 제도의 취지/본질 왜곡 유도: 해당 법률 제도의 근본적인 목적이나 법원의 의무 사항을 재량 사항으로 축소하여 설정 
Step 5: 생성된 문제에 대한 해설을 작성한다. 해설은 각 선지별로 어느 부분에 근거하여 옳고 그른지를 설명해야 한다.
    
결과는 반드시 한국어로 작성해야 합니다. 

<예시>
[규정]을 <사례>에 적용한 것으로 옳지 않은 것을 고른 것은?
[규정] 
제O조
제O조
<사례> 
<선택지>
ㄱ.
ㄴ.
ㄷ.
ㄹ. 
<해설> 
각 선지별로 작성 
정답: 
</예시>

#####
{format_instructions}
"""
