# 판결요지가 1개인 경우
MCQA_PROMPT_SINGLE = """
당신은 시험 및 기업 교육을 위한 객관식 문제 제작 전문가 교수입니다. 당신의 임무는 응시자의 지식을 종합적으로 평가할 수 있는 도전적이고 잘 구성된 객관식 문제를 개발하는 것입니다.

다음은 하나의 법적 사례 ("Case"로 주어짐)와 해당하는 판례 ("Precedent") 및 정답이 되는 판결요지 ("Judgement")입니다: 

법적 사례가 주어졌을 때, 정답 판결요지를 간결하게 요약하여 작성하는 것과 <오답 선지 유형>을 활용하여 법리적으로 타당해보이지만 결론은 틀린 고난도 오답 선지를 3개 생성해야 합니다. 
정답은 그대로 유지되어야 하며, 정답은 반드시 1개여야 합니다. 
오답 생성 시 판례를 기반으로 하여 생성해야 하며, 판례 외의 사실, 법조문을 새로 만들어내서는 안 된다.

<오답 선지 유형>
- 구성요건의 핵심 요소 1개를 누락하거나 전도
- 법리의 적용 범위를 과도하게 확장하거나 축소
- 절차 요건과 실체 요건을 혼동
- 비핵심 사실을 법적 근거로 오인하도록 유도

생성 결과는 반드시 한국어로 각각 작성해야 하며, 반드시 한 문장 또는 두 문장으로 출력해야 합니다.
사고 과정 및 오답 선지 유형을 출력해서는 안 되며, 생성된 오답 선지의 내용만 출력하시오. 1. ~ 2. ~ 3. ~ 4. ~ 의 형태로 출력해야 하며, 정답에는 [정답]으로 표시해야 합니다. 

--------------------------
Case:
{input_query} 
Precedent: 
{precedent} 
Judgement: 
{judge}

--------------------------
""".strip()

# 판결요지가 2개인 경우
MCQA_PROMPT_DOUBLE = """
당신은 시험 및 기업 교육을 위한 객관식 문제 제작 전문가 교수입니다. 당신의 임무는 응시자의 지식을 종합적으로 평가할 수 있는 도전적이고 잘 구성된 객관식 문제를 개발하는 것입니다.

다음은 하나의 법적 사례 ("Case"로 주어짐)와 해당하는 판례 ("Precedent") 및 정답이 되는 판결요지 ("Judgement")입니다: 

법적 사례가 주어졌을 때, 정답 선지 1개와 오답 선지 3개를 생성해야 합니다.
정답 판결요지 2개 중 1개는 그대로 정답으로 유지해야 하며, 간결하게 요약하여 작성해야 합니다. 나머지 1개는 오답 선지로 변형해야 합니다.
<오답 선지 유형>을 활용하여 법리적으로 타당해보이지만 결론은 틀린 고난도 오답 선지를 3개 생성해야 합니다. 오답 생성 시 판례를 기반으로 하여 생성해야 하며, 판례 외의 사실, 법조문을 새로 만들어내서는 안 된다.

<오답 선지 유형>
- 구성요건의 핵심 요소 1개를 누락하거나 전도
- 법리의 적용 범위를 과도하게 확장하거나 축소
- 절차 요건과 실체 요건을 혼동
- 비핵심 사실을 법적 근거로 오인하도록 유도

생성 결과는 반드시 한국어로 각각 작성해야 하며, 반드시 한 문장 또는 두 문장으로 출력해야 합니다.
사고 과정 및 오답 선지 유형을 출력해서는 안 되며, 생성된 오답 선지의 내용만 출력하시오. 1. ~ 2. ~ 3. ~ 4. ~ 의 형태로 출력해야 하며, 정답에는 [정답]으로 표시해야 합니다. 

--------------------------
Case:
{input_query}
Precedent:
{precedent}
Judgement:
{judge_1}
{judge_2}

--------------------------
""".strip()